Enums/ЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриемеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотрениеОтклика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЭтапыРаботыСКандидатами/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВсеЭтапы() Экспорт
	
	ЭтапыРаботы = Новый Массив;
	ЭтапыРаботы.Добавить(Утверждение);
	ЭтапыРаботы.Добавить(РешениеОПриемеНаРаботу);
	ЭтапыРаботы.Добавить(ПриемНаРаботу);
	ЭтапыРаботы.Добавить(РаботаЗавершена);
	
	Возврат ЭтапыРаботы;

КонецФункции

Функция Действующие() Экспорт
	
	ЭтапыРаботы = Новый Массив;
	ЭтапыРаботы.Добавить(Утверждение);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОПриемеНаРаботу") Тогда
		ЭтапыРаботы.Добавить(РешениеОПриемеНаРаботу);
	КонецЕсли;
	ЭтапыРаботы.Добавить(ПриемНаРаботу);
	
	Возврат ЭтапыРаботы;

КонецФункции

Функция СтрогоПоследовательные() Экспорт
	
	ЭтапыРаботы = Новый Массив;
	ЭтапыРаботы.Добавить(Утверждение);
	ЭтапыРаботы.Добавить(РешениеОПриемеНаРаботу);
	
	Возврат ЭтапыРаботы;
	
КонецФункции

// Сведения об этапах.
// 
// Параметры:
//  ЭтапыРаботы - Массив из ОпределяемыйТип.ЭтапРаботыСКандидатами -
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - ОпределяемыйТип.ЭтапРаботыСКандидатами
//   * Значение - см. СведенияОбЭтапе
Функция СведенияОбЭтапах(ЭтапыРаботы) Экспорт
	
	Сведения = Новый Соответствие();
	
	Для Каждого ЭтапРаботы Из ЭтапыРаботы Цикл
		Сведения.Вставить(ЭтапРаботы, СведенияОбЭтапе(ЭтапРаботы));
	КонецЦикла;
	
	Возврат Сведения;
	
КонецФункции

// Сведения об этапе.
// 
// Параметры:
//  ЭтапРаботы - ОпределяемыйТип.ЭтапРаботыСКандидатами
// 
// Возвращаемое значение:
//  Структура - Сведения об этапе:
// * Предопределенный - Булево -
// * СтрогоПоследовательный - Булево -
// * Последовательность - Массив из ОпределяемыйТип.ЭтапРаботыСКандидатами
Функция СведенияОбЭтапе(ЭтапРаботы)
	
	Последовательность = СтрогоПоследовательные();
	
	Сведения = Новый Структура();
	Сведения.Вставить("Предопределенный", ЭтоПредопределенный(ЭтапРаботы));
	Сведения.Вставить("СтрогоПоследовательный", Последовательность.Найти(ЭтапРаботы) <> Неопределено);
	Сведения.Вставить("Последовательность", ?(Сведения.СтрогоПоследовательный, Последовательность, Новый Массив));
	
	Возврат Сведения;
	
КонецФункции

// Определяет, что этот этап относится к предопределенным.
// 
// Параметры:
//  ЭтапРаботы - ОпределяемыйТип.ЭтапРаботыСКандидатами
// 
// Возвращаемое значение:
//  Булево - Это предопределенный
Функция ЭтоПредопределенный(ЭтапРаботы) Экспорт
	Возврат ВсеЭтапы().Найти(ЭтапРаботы) <> Неопределено;
КонецФункции

// Уточнить время этапа.
// Сдвигаем этапы на оси времени, чтобы предопределенные этапы могли случаться в один день.
// 
// Параметры:
//  ЭтапРаботы - ПеречислениеСсылка.ЭтапыРаботыСКандидатами
//  ДатаЭтапа - Дата
// 
// Возвращаемое значение:
//  Дата - Уточнить время этапа
Функция УточнитьВремяЭтапа(ЭтапРаботы, ДатаЭтапа) Экспорт
	
	Если ЭтоПредопределенный(ЭтапРаботы) И
		НачалоДня(ДатаЭтапа) = НачалоДня(ТекущаяДатаСеанса()) Тогда
		
		ДатаЭтапа = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	Возврат ДатаЭтапа;
	
КонецФункции

#КонецОбласти

#КонецЕсли
